app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "投稿s"], ["body", "詳細p"], ["created_at", "2021-02-20 13:57:13.336839"], ["updated_at", "2021-02-20 13:57:13.336839"]]
---
  def create
    list = List.new(list_params)
    list.save

SELECT "lists".* FROM "lists"
---
  def index
    puts  ENV['SECRET_KEY']
    @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "本 \n追記：編集機能を作りました。"], ["updated_at", "2021-02-20 16:15:45.310883"], ["id", 1]]
---
  def update
    list = List.find(params[:id])
    list.update(list_params)